Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: [Search]
pt_pt: [Busca]

source: Skip Quicknav
pt_pt: Pular "Quicknav"

source: Debian Social Contract
pt_pt: Contrato Social Debian

source: Version 1.2 ratified on October 1st, 2022.
pt_pt: Versão 1.2 ratificada em 1 de outubro de 2022.

source: Supersedes Version 1.1 ratified on April 26th, 2004, and Version 1.0 ratified on July 5, 1997.
pt_pt: Substitui a versão 1.1 ratificada em 26 de abril de 2004. e a versão 1.0 ratificada em 5 de julho de 1997.

source: Debian, the producers of the Debian system, have created the Debian Social Contract. The Debian Free Software Guidelines (DFSG) part of the contract, initially designed as a set of commitments that we agree to abide by, has been adopted by the free software community as the basis of the Open Source Definition.
pt_pt: O Projeto Debian, produtor do sistema Debian, criou o Contrato Social Debian. A Definição Debian de Software Livre (DFSG), parte do contrato, inicialmente concebido como um conjunto de compromissos públicos que concordamos em respeitar, foi adotada pela comunidade de software livre como a base para a Definição Open Source.

source: Social Contract with the Free Software Community
pt_pt: Contrato Social perante a Comunidade de Software Livre

source: 1. Debian will remain 100% free
pt_pt: 1. O Debian permanecerá 100% livre

source: We provide the guidelines that we use to determine if a work is free in the document entitled The Debian Free Software Guidelines. We promise that the Debian system and all its components will be free according to these guidelines. We will support people who create or use both free and non-free works on Debian. We will never make the system require the use of a non-free component.
pt_pt: Disponibilizamos as definições que usamos para determinar se um software é livre no documento intitulado Definição Debian de Software Livre (DFSG). Prometemos que o sistema Debian e todos seus componentes serão livres de acordo com essas definições. Iremos fornecer suporte às pessoas que desenvolvem ou usam software livre e não livre no Debian. Nunca faremos o sistema depender de um componente não livre.

source: 2. We will give back to the free software community
pt_pt: 2. Iremos retribuir à comunidade software livre

source: When we write new components of the Debian system, we will license them in a manner consistent with the Debian Free Software Guidelines. We will make the best system we can, so that free works will be widely distributed and used. We will communicate things such as bug fixes, improvements and user requests to the upstream authors of works included in our system.
pt_pt: Quando escrevermos novos componentes do sistema Debian, nós o licenciaremos de um modo consistente com a Definição Debian de Software Livre. Iremos fazer o melhor sistema que pudermos, de modo que o software livre seja amplamente distribuído e utilizado. Iremos comunicar aos(às) autores(as) originais (upstream) dos componentes usados em nosso sistema coisas como correções de bugs, aperfeiçoamentos e solicitações de usuários(as).

source: 3. We will not hide problems
pt_pt: 3. Não esconderemos problemas

source: We will keep our entire bug report database open for public view at all times. Reports that people file online will promptly become visible to others.
pt_pt: Iremos manter nosso banco de dados de relatório de bugs aberto para a visualização pública todo o tempo. Os relatórios que as pessoas preenchem online ficarão visíveis imediatamente para todos as outras pessoas.

source: 4. Our priorities are our users and free software
pt_pt: 4. Nossas prioridades são nossos(as) usuários(as) e o software livre

source: We will be guided by the needs of our users and the free software community. We will place their interests first in our priorities. We will support the needs of our users for operation in many different kinds of computing environments. We will not object to non-free works that are intended to be used on Debian systems, or attempt to charge a fee to people who create or use such works. We will allow others to create distributions containing both the Debian system and other works, without any fee from us. In furtherance of these goals, we will provide an integrated system of high-quality materials with no legal restrictions that would prevent such uses of the system.
pt_pt: Nos guiaremos pelas necessidades de nossos(as) usuários(as) e da comunidade software livre. Colocaremos seus interesses em primeiro lugar nas nossas prioridades. Iremos fornecer suporte às necessidades de nossos(as) usuários(as) para que o sistema funcione em diversos tipos de ambientes computacionais. Não faremos objeção a softwares não livres destinados a rodar em sistemas Debian, nem tentaremos cobrar taxa alguma às pessoas que criarem ou utilizarem estes softwares. Permitiremos que outras pessoas criem distribuições contendo o sistema Debian e outros softwares, sem cobrar taxa alguma. Para atender a estes objetivos, disponibilizaremos um sistema integrado, com materiais de alta qualidade, e sem restrições legais que possam impedir tais usos do mesmo.

source: 5. Works that do not meet our free software standards
pt_pt: 5. Programas que não atendem nossos padrões de software livre

source: We acknowledge that some of our users require the use of works that do not conform to the Debian Free Software Guidelines. We have created contrib and non-free areas in our archive for these works. The packages in these areas are not part of the Debian system, although they have been configured for use with Debian. We encourage CD manufacturers to read the licenses of the packages in these areas and determine if they can distribute the packages on their CDs. Thus, although non-free works are not a part of Debian, we support their use and provide infrastructure for non-free packages (such as our bug tracking system and mailing lists). The Debian official media may include firmware that is otherwise not part of the Debian system to enable use of Debian with hardware that requires such firmware.
pt_pt: Reconhecemos que alguns de nossos(as) usuários(as) precisam usar softwares que não atendem à Definição Debian de Software Livre. Criamos as áreas contrib e non-free em nossos repositórios para estes softwares. Os pacotes contidos nessas áreas não são parte do sistema Debian, embora tenham sido configurados para funcionar no Debian. Incentivamos os fornecedores de CDs a ler as licenças dos pacotes armazenados nessas áreas, a fim de determinar se podem distribuí-los em seus CDs. Portanto, embora softwares não livres não sejam parte do Debian, oferecemos suporte à sua utilização e disponibilizamos infraestrutura para pacotes não livres (como nosso sistema de controle de bugs e listas de discussão). A mídia oficial do Debian pode incluir firmware que não faz parte do sistema Debian para permitir o uso do Debian com hardware que requer tal firmware.

source: The Debian Free Software Guidelines (DFSG)
pt_pt: A Definição Debian de Software Livre (DFSG - Debian Free Software Guidelines)

source: 1. Free Redistribution
pt_pt: 1. Redistribuição livre

source: The license of a Debian component may not restrict any party from selling or giving away the software as a component of an aggregate software distribution containing programs from several different sources. The license may not require a royalty or other fee for such sale.
pt_pt: A licença de um componente Debian não pode restringir nenhuma parte interessada em vender ou distribuir o software como parte de uma distribuição agregada de software contendo programas de diversas fontes diferentes. A licença não pode exigir um royalty (direito autoral) ou outra taxa por esta venda.

source: 2. Source Code
pt_pt: 2. Código-fonte

source: The program must include source code, and must allow distribution in source code as well as compiled form.
pt_pt: O programa deve incluir código-fonte e deve permitir a distribuição em código-fonte, bem como em formato compilado.

source: 3. Derived Works
pt_pt: 3. Trabalhos Derivados

source: The license must allow modifications and derived works, and must allow them to be distributed under the same terms as the license of the original software.
pt_pt: A licença deve permitir modificações e trabalhos derivados, e deve permitir que estes sejam distribuídos sob os mesmos termos da licença do software original.

source: 4. Integrity of The Author's Source Code
pt_pt: 4. Integridade do código-fonte do(a) autor(a)

source: The license may restrict source-code from being distributed in modified form only if the license allows the distribution of patch files with the source code for the purpose of modifying the program at build time. The license must explicitly permit distribution of software built from modified source code. The license may require derived works to carry a different name or version number from the original software. (This is a compromise. The Debian group encourages all authors not to restrict any files, source or binary, from being modified.)
pt_pt: A licença pode restringir o código-fonte de ser distribuído de forma modificada somente se a licença permitir a distribuição de arquivos patch com o código-fonte com o propósito de modificar o programa em tempo de compilação. A licença deve permitir explicitamente a distribuição de software compilado a partir do código-fonte modificado. A licença pode exigir que trabalhos derivados tenham um nome ou número de versão diferente do software original (Isso é um compromisso. O grupo Debian encoraja todos(as) os(as) autores(as) a não restringir nenhum arquivo, fonte ou binário, de ser modificado).

source: 5. No Discrimination Against Persons or Groups
pt_pt: 5. Não à discriminação contra pessoas ou grupos.

source: The license must not discriminate against any person or group of persons.
pt_pt: A licença não pode discriminar nenhuma pessoa ou grupo de pessoas.

source: 6. No Discrimination Against Fields of Endeavor
pt_pt: 6. Não à discriminação contra fins de utilização

source: The license must not restrict anyone from making use of the program in a specific field of endeavor. For example, it may not restrict the program from being used in a business, or from being used for genetic research.
pt_pt: A licença não pode restringir ninguém de fazer uso do programa para um fim específico. Por exemplo, ela não pode restringir o programa de ser usado no comércio, ou de ser usado para pesquisa genética.

source: 7. Distribution of License
pt_pt: 7. Distribuição de licença

source: The rights attached to the program must apply to all to whom the program is redistributed without the need for execution of an additional license by those parties.
pt_pt: Os direitos atribuídos ao programa devem aplicar-se a todos aqueles para quem o programa é redistribuído, sem a necessidade de execução de uma licença adicional por essas partes.

source: 8. License Must Not Be Specific to Debian
pt_pt: 8. A licença não pode ser específica para o Debian

source: The rights attached to the program must not depend on the program's being part of a Debian system. If the program is extracted from Debian and used or distributed without Debian but otherwise within the terms of the program's license, all parties to whom the program is redistributed should have the same rights as those that are granted in conjunction with the Debian system.
pt_pt: Os direitos atribuídos ao programa não podem depender do programa ser parte de um sistema Debian. Se o programa for extraído do Debian e usado ou distribuído sem o Debian, dentro dos termos da licença do programa, os mesmos direitos garantidos em conjunto ao sistema Debian deverão ser garantidos àqueles que o utilizam.

source: 9. License Must Not Contaminate Other Software
pt_pt: 9. A licença não deve contaminar outros softwares.

source: The license must not place restrictions on other software that is distributed along with the licensed software. For example, the license must not insist that all other programs distributed on the same medium must be free software.
pt_pt: A licença não poderá restringir outro software que é distribuído juntamente com o software licenciado. Por exemplo, a licença não pode insistir que todos os outros programas distribuídos na mesma mídia sejam software livre.

source: 10. Example Licenses
pt_pt: 10. Licenças exemplo

source: The GPL, BSD, and Artistic licenses are examples of licenses that we consider free.
pt_pt: As licenças GPL, BSD e Artistic são exemplos de licenças que consideramos livres.

source: The concept of stating our social contract with the free software community was suggested by Ean Schuessler. This document was drafted by Bruce Perens, refined by the other Debian developers during a month-long e-mail conference in June 1997, and then accepted as the publicly stated policy of the Debian Project.
pt_pt: O conceito de declarar nosso contrato social para a comunidade de software livre foi sugerido por Ean Schuessler. O rascunho deste documento foi escrito por Bruce Perens, refinado por outros(as) desenvolvedores(as) Debian durante uma conferência via e-mail que durou um mês, em junho de 1997, e então aceita como uma política do Projeto Debian, declarada publicamente.

source: Bruce Perens later removed the Debian-specific references from the Debian Free Software Guidelines to create The Open Source Definition.
pt_pt: Mais tarde, Bruce Perens removeu as referências específicas do Debian da Definição Debian de Software Livre para criar a Definição de Código Aberto.

source: Other organizations may derive from and build on this document. Please give credit to the Debian project if you do.
pt_pt: Outras organizações podem fazer derivações deste documento. Por favor, dê o crédito ao Projeto Debian se você fizer isso.

source: Back to the Debian Project homepage.
pt_pt: Voltar para a página principal do Projeto Debian.

source: This page is also available in the following languages:
pt_pt: Esta página também está disponível nos seguintes idiomas:

source: عربية (Arabiya) Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) español فارسی (Farsi) français Galego hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski Português Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)
pt_pt: عربية (Arabiya) Български (Bəlgarski) català česky dansk Deutsch Ελληνικά (Ellinika) English español فارسی (Farsi) français Galego hrvatski Italiano 한국어 (Korean) magyar Nederlands 日本語 (Nihongo) norsk (bokmål) polski Русский (Russkij) slovenčina suomi svenska Tiếng Việt Türkçe українська (ukrajins'ka) 中文(简) 中文(HK) 中文(繁)

source: How to set the default document language
pt_pt: Como configurar o idioma padrão dos documentos

source: Home
pt_pt: Página Principal

source: · About
pt_pt: · Sobre

source: o Social Contract
pt_pt: o Contrato Social

source: o Code of Conduct
pt_pt: o Código de Conduta

source: o Free Software
pt_pt: o Software Livre

source: o Legal Info
pt_pt: o Informações legais

source: · Help Debian
pt_pt: · Ajude o Debian

source: · Getting Debian
pt_pt: · Obtendo o Debian

source: o Network install
pt_pt: o Instalação via Rede

source: o CD/USB ISO images
pt_pt: o Imagens de CD/USB ISO

source: o Debian Packages
pt_pt: o Pacotes do Debian

source: o Developers' Corner
pt_pt: o Canto dos(as) desenvolvedores(as)

source: · News
pt_pt: · Notícias

source: o Project News
pt_pt: o Notícias do Projeto

source: o Events
pt_pt: o Eventos

source: · Documentation
pt_pt: · Documentação

source: o Release Info
pt_pt: o Informações sobre Versões

source: o Debian Wiki
pt_pt: o Wiki do Debian

source: · Support
pt_pt: · Suporte

source: o Debian International
pt_pt: o Debian Internacional

source: o Security Information
pt_pt: o Informações sobre Segurança

source: o Bug reports
pt_pt: o Relatórios de Bug

source: o Mailing Lists
pt_pt: o Listas de Discussão

source: · Site map
pt_pt: · Mapa do site

source: · Search
pt_pt: · Busca

source: · The Debian Blog
pt_pt: · O Blog do Debian

source: See our contact page to get in touch. Web site source code is available.
pt_pt: Veja nossa página de contato para falar conosco. O código-fonte do site web está disponível.

source: Last Modified: Wed, Oct 5 01:47:24 UTC 2022 Last Built: Tue, Aug 6 19:26:33 UTC 2024
pt_pt: Última Modificação: Dom, 9 de Out de 2022, 18:34:34 UTC Última compilação: Ter, 6 de Ago de 2024, 21:57:18 UTC

source: Copyright © 1997-2022 SPI and others; See license terms
pt_pt: Copyright © 1997-2022 SPI e outros; Veja os termos de licença

source: Debian is a registered trademark of Software in the Public Interest, Inc.
pt_pt: Debian é uma marca registrada da Software in the Public Interest, Inc.

source: Introduction to Debian / About Debian
pt_pt: Introdução ao Debian / Sobre o Debian

source: About Debian
pt_pt: Sobre o Debian

source: · WHAT is Debian anyway?
pt_pt: · Afinal de contas, O QUE é o Debian?

source: · It's all free?
pt_pt: · É tudo livre?

source: · You say free, but the CDs/bandwidth cost money!
pt_pt: · Você diz livre, mas os CDs e a banda de rede custam dinheiro!

source: · Most software costs over a hundred dollars. How can you give it away?
pt_pt: · A maioria dos softwares custa mais de 100 dólares. Como vocês conseguem distribuí-lo assim?

source: · What hardware is supported?
pt_pt: · Qual hardware é suportado?

source: · Before I decide, I need more information.
pt_pt: · Antes de decidir, preciso de mais informações.

source: · I'm still not convinced. What are some pros and cons of Debian?
pt_pt: · Ainda não estou convencido(a). Quais são alguns prós e contras do Debian?

source: · How do I get Debian?
pt_pt: · Como eu consigo o Debian?

source: · I can't set it up all by myself. Where do I get support for Debian?
pt_pt: · Eu não consigo configurar tudo sozinho(a). Onde eu consigo ajuda para o Debian?

source: · Who are you all anyway?
pt_pt: · Afinal de contas, quem são vocês?

source: · Who uses Debian?
pt_pt: · Quem usa Debian?

source: · How'd it all get started?
pt_pt: · Como tudo isso começou?

source: WHAT is Debian?
pt_pt: Afinal de contas, O QUE é o Debian?

source: The Debian Project is an association of individuals who have made common cause to create a free operating system. This operating system that we have created is called Debian.
pt_pt: O Projeto Debian é uma associação de indivíduos que têm como causa comum criar um sistema operacional livre. O sistema operacional que criamos é chamado Debian.

source: An operating system is the set of basic programs and utilities that make your computer run. At the core of an operating system is the kernel. The kernel is the most fundamental program on the computer and does all the basic housekeeping and lets you start other programs.
pt_pt: Um sistema operacional é o conjunto de programas básicos e utilitários que fazem seu computador funcionar. No núcleo do sistema operacional está o kernel. O kernel é o programa mais fundamental no computador e faz todas as operações mais básicas, permitindo que você execute outros programas.

source: Debian systems currently use the Linux kernel or the FreeBSD kernel. Linux is a piece of software started by Linus Torvalds and supported by thousands of programmers worldwide. FreeBSD is an operating system including a kernel and other software.
pt_pt: Os sistemas Debian atualmente usam o kernel Linux ou o kernel FreeBSD. O Linux é um software criado inicialmente por Linus Torvalds com a ajuda de milhares de programadores(as) espalhados(as) por todo o mundo. O FreeBSD é um sistema operacional que inclui um kernel e outros softwares.

source: However, work is in progress to provide Debian for other kernels, primarily for the Hurd. The Hurd is a collection of servers that run on top of a microkernel (such as Mach) to implement different features. The Hurd is free software produced by the GNU project.
pt_pt: No entanto, existe um esforço para fornecer o Debian para outros kernels, principalmente para o Hurd. O Hurd é um conjunto de servidores que rodam em cima de um microkernel (como o Mach) a fim de implementar diferentes funcionalidades. O Hurd é um software livre produzido pelo projeto GNU.

source: A large part of the basic tools that fill out the operating system come from the GNU project; hence the names: GNU/Linux and GNU/Hurd. These tools are also free.
pt_pt: Uma grande parte das ferramentas básicas que formam o sistema operacional origina-se do projeto GNU; daí os nomes: GNU/Linux e GNU/Hurd. Essas ferramentas também são livres.

source: Of course, the thing that people want is application software: programs to help them get what they want to do done, from editing documents to running a business to playing games to writing more software. Debian comes with over 59000 packages (precompiled software that is bundled up in a nice format for easy installation on your machine), a package manager (APT), and other utilities that make it possible to manage thousands of packages on thousands of computers as easily as installing a single application. All of it free.
pt_pt: Claro, o que as pessoas querem são os aplicativos: programas para ajudá-las a realizar suas tarefas, desde a edição de documentos até a administração de negócios, passando por jogos e desenvolvimento de mais softwares. O Debian vem com mais de 59000 pacotes (softwares pré-compilados e empacotados em um formato amigável, o que faz com que sejam de fácil instalação em sua máquina), um gerenciador de pacotes (APT) e outros utilitários que tornam possível gerenciar milhares de pacotes em milhares de computadores de maneira tão fácil quanto instalar um único aplicativo. Todos são livres.

source: It's a bit like a tower. At the base is the kernel. On top of that are all the basic tools. Next is all the software that you run on the computer. At the top of the tower is Debian — carefully organizing and fitting everything so it all works together.
pt_pt: Funciona como uma torre: na base está o kernel. Sobre ele estão todas as ferramentas básicas. Acima delas estão todos os outros softwares que você executa em seu computador. No topo da torre está o Debian — cuidadosamente organizando e ajustando o restante de modo que tudo funcione em conjunto.

source: It's all free?
pt_pt: É tudo livre?
